# 1. Написати програму, яка обчислюватиме суму, різницю і добуток двох цілих чисел.
def calcul(a,b):
    print(a, " + ", b, " = ", a+b )
    print(a, " - ", b, " = ", a-b )
    print(a, " * ", b, " = ", a*b )

#2. Користувач задає розміри прямокутного паралелепіпеда. Програма повинна обчислити об´єм і площу поверхні прямокутного паралелепіпеда. 
def paral(a,b,c):
    print ("S = ", 2 *(a*b + b*c + a*c))
    print ("V = ", a*b*c)

"""
s = 12345
tmp = list(str(s))
print(int(tmp[0]))
"""

a = int(input("введіть перше число => "))
b = int(input("введіть друге число => "))

calcul(a,b)

print("==============================")

a = int(input("введіть довжину першого ребра => "))
b = int(input("введіть довжину другого ребра => "))
c = int(input("введіть довжину третього ребра => "))
print("\n")

paral(a,b,c)









